[
  {
    "id":241,
    "title":"Dependency resolver for applications written in Perl",
    "short_description":"The aim of this project is to develop a module/script that will be able to traverse an entire tree of files that belongs to any Perl codebase, parse all those files, and retrieve a complete list of dependencies that are used/required across that codebase. There will be an option to filter-out modules belonging to specific namespaces (for example \"XING::\" and/or \"OBC::\") in order to make sure that only CPAN modules appear in the output list. If a module is required in a specific version, this information will also be included in the output.",
    "description":"The aim of this project is to develop a module/script that will be able to traverse an entire tree of files that belongs to any Perl codebase, parse all those files, and retrieve a complete list of dependencies that are used/required across that codebase. There will be an option to filter-out modules belonging to specific namespaces (for example \"XING::\" and/or \"OBC::\") in order to make sure that only CPAN modules appear in the output list. If a module is required in a specific version, this information will also be included in the output.\r\n\r\nI believe that such project would significantly shorten the time of deployment for any Perl application that is usually needed to gather all the information about requirements that rely on undocumented dependencies on modules that were once assumed to be deployed on production servers (and it should obviously not be limited to XING environment only).\r\n\r\nPlease tell me if you are aware of any existing tool that already does that. I do not know any, however I would like to make sure that work performed here as a part of this story would not duplicate an already existing utility.",
    "city":null,
    "event":{
      "id":13,
      "title":"Prototyping Days #1", "calendar_week":201912, "created_at":"2018-02-18T09:56:20.000Z", "updated_at":"2018-02-18T09:56:20.000Z",
      "project_deadline":null
    },
    "talk":true,
    "order":1,
    "category":null,
    "image":"https://media.giphy.com/media/cfuL5gqFDreXxkWQ4o/giphy.gif",
    "user":{
      "username":"dart.vader",
      "name":"Dart Vader",
      "profile_url":null
    }
  },
  {
    "id":242,
    "title":"Main Taskbar Usability Optline-heightimization",
    "short_description":"This project aims to optimize the Usability of our current XING-Main Taskbars through coherent simplification and fixation, so that all products are easy recognizable \u0026 always available. ",
    "description":"This project aims to optimize the Usability of our current XING-Main Taskbars through coherent simplification and fixation, so that all products are easy recognizable \u0026 always available. \r\nThe current situation: You have a duplication of products taskbuttons, one on the left side (notification bar) and the second Main Taskbar at the top:\r\n-\tSome products are not available at the Notification Bar (Topics, Projects)\r\n-\tSome are not available at the Main taskbar (Contacts, Inbox)\r\n-\tSome Main products are only situated at the Startpage Subtaskbar (Contacts, Inbox) \r\n-\tProduct Search is not fixed, it disappears if you scroll down (all other social platforms have fixed Searchproduct)\r\nThis is confusing and not transparent for the User. Since X4 Users are claiming about the Usability of the platform. \r\n\r\nMy proposal: Either one Main Vertical Taskbar or one Main Horizontal Taskbar. \r\n\r\nAfter analyzing our platform, analyzing what the competition does (LinkedIn, Facebook, Google+), I already designed two Versions:\r\n\r\nVersion A): Fixed Vertical Taskbar with fixed Search on top – Subcategories directly at the top of each each product-home-page (nice for mobile format) \r\nVersion B): Fixed Horizontal Taskbar with fixed Search on top – Subcategories on Left side \r\n\r\n\r\n\r\nIn my opinion the success of our current strategy is also very related with this usability optimization, as it is very important that users realizes very fast which products do we offer and have easy access to them. \r\n\r\nI know how complex it is to build a cross-functional product like that, but the innoweek is the right place to create two dummy versions to first see how it could work. \r\n\r\nI invite you to help me create and improve this challenge! \r\n\r\nWe have a wonderful platform. Let's rock it or better to say make it more usabilibeautiful!\r\n\r\nBest regards, \r\n\r\nHoracio \r\n",
    "city":null,
    "event":{
      "id":13,
      "title":"Prototyping Days #1", "calendar_week":201912, "created_at":"2018-02-18T09:56:20.000Z", "updated_at":"2018-02-18T09:56:20.000Z",
      "project_deadline":null
    },
    "talk":true,
    "order":1,
    "category":null,
    "image":"https://i.giphy.com/media/11c7UUfN4eoHF6/giphy.webp",
    "user":{
      "username":"horacio.ccitandov",
      "name":"Horacio Ccitandov",
      "profile_url":null
    }
  },
  {
    "id":243,
    "title":"USort: Sorting list of users",
    "short_description":"We have multiple places on XING where we show lists of users sorted by there name. Often, our members would benefit if these lists would be sorted and contextualized according to the current demands of a member. Some examples: ",
    "description":"We have multiple places on XING where we show lists of users sorted by there name. Often, our members would benefit if these lists would be sorted and contextualized according to the current demands of a member. Some examples: \r\n\r\n\r\n- When you do a friendship and your friend has less then 10 contacts, you are requested to provide some friend recommendations to your friend. Today, XING users often have to go through there list of contacts from A to Z to find some persons that they could recommend to their friend. Would people be more encouraged to to send recommendations if proper contacts are show at the top of the list? \r\n\r\n\r\n - When people visit events, they might be interested in browsing the participants of the event. It could help people a lot to have the participants sorted according to certain criteria.\r\n\r\n\r\nI could continue this list, but it seems enough to get the idea. Based on the sorting functionality, one could then also think about further applications. For example, given the friendship suggestion use case, one could provide functionaliy such as \"Do you think that Adam knows Bob, Claude and Mary? If so click, click here to send suggest Adam to connect with them:-)\" so that suggestions could be sent with one click.\r\n\r\nIn order to respect the 20% effort / 80% value rule, cMYMK will be used to sort and later filter the results.\r\n\r\nFor this project, I/we will need your help so that we get at least one example running and ready for an A/B Testing.\r\n",
    "city":null,
    "event":{
      "id":13,
      "title":"Prototyping Days #1", "calendar_week":201912, "created_at":"2018-02-18T09:56:20.000Z", "updated_at":"2018-02-18T09:56:20.000Z",
      "project_deadline":null
    },
    "talk":true,
    "order":1,
    "category":null,
    "image":"https://media.giphy.com/media/cfuL5gqFDreXxkWQ4o/giphy.gif",
    "user":{
      "username":"marcis.ruben",
      "name":"Marcis Ruben",
      "profile_url":null
    }
  },
  {
    "id":245,
    "title":"Vector Sprites",
    "short_description":"Vector Sprites",
    "description":"Vector Sprites\r\n\r\nVector Sprites are automated. Just savea SVG file and incorporate it with a single line of scss code.\r\n\r\nVector Sprites is an easy-to-use approach for combining thousands of Vector Shapes (110.000 according to latest Unicode Standard, 6.2.0 – at least 7.000 vector shapes) to a single file delivered to the client: a web font. This results in:\r\n\r\nA) Reduced File Size for Icon Set\r\nB) Ultimate flexibility regarding Screen Resolutions and desired dimensions\r\nC) Opportunities to play with :hover, :active,:focus, :visited states, as well as opacity and text-shadow without affecting file sizes significantly\r\n\r\nfor detailed information, please see my private pet project (WIP)\r\nhttps://github.com/WanHalo/fungo\r\n\r\n\r\nWould be cool to hava rails expert who can help providing this as a gem so the setup is super-easy.",
    "city":null,
    "event":{
      "id":13,
      "title":"Prototyping Days #1",
      "calendar_week":201912, "created_at":"2018-02-18T09:56:20.000Z", "updated_at":"2018-02-18T09:56:20.000Z",
      "project_deadline":null
    },
    "talk":true,
    "order":1, "category":null,
    "image":"https://i.giphy.com/media/OmK8lulOMQ9XO/giphy.webp",
    "user":{
      "username":"jaben.reusse",
      "name":"Jaben Reusse",
      "profile_url":null
    }
  },
  {
    "id":246,
    "title":"Stats for Postings",
    "short_description":"To make the Job Poster more satisfied we want to add graphs to their postings.",
    "description":"To make the Job Poster more satisfied we want to add graphs to their postings.\r\n\r\n",
    "city":null,
    "event":{
      "id":10,
      "title":"Prototyping Days #1",
      "calendar_week":201912, "created_at":"2018-02-18T09:56:20.000Z", "updated_at":"2018-02-18T09:56:20.000Z",
      "project_deadline":null
    },
    "talk":true,
    "order":1,
    "category":null,
    "image":"https://i.giphy.com/media/NqZn5kPN8VVrW/giphy.webp",
    "user":{
      "username":"martish.tuch",
      "name":"Martish Tuch",
      "profile_url":null
    }
  }
]